"""
conversation starter questions...
Syntax: .qt
  inspired by @Deonnn's being_logical.py
  edited by : @mahshook_bot
"""



from telethon import events



import asyncio



import os



import sys



import random


from userbot.utils import admin_cmd






@borg.on(admin_cmd(pattern=r"qt"))



async def _(event):



    if event.fwd_from:



        return



    await event.edit("selecting question...")



    await asyncio.sleep(2)



    x=(random.randrange(1,60))



    if x==1:



        await event.edit("`\"முக்கியத்துவம், இறங்கு வரிசையில் அவற்றை ஒழுங்குபடுத்துங்கள் - பணம், அன்பு, குடும்பம், தொழில், நண்பர்கள்.\"`")



    if x==2:



        await event.edit("`\"உங்கள் பெயரை மாற்ற வேண்டியிருந்தால், உங்கள் புதிய பெயர் என்னவாக இருக்கும், ஏன் அந்த பெயரை தேர்வு செய்வீர்கள்?\"`")



    if x==3:



        await event.edit("`\"இந்த வாரம் நீங்கள் படித்த அல்லது பார்த்த மிகவும் சுவாரஸ்யமான விஷயம் என்ன?\"`")



    if x==4:



        await event.edit("`\"ஒரு தொலைக்காட்சி நிகழ்ச்சியின் எந்த காட்சியை நீங்கள் ஒருபோதும் மறக்க மாட்டீர்கள்?\"`")



    if x==5:



        await event.edit("`\"நீங்கள் ஒரு திறமையில் மாஸ்டர் ஆக முடிந்தால், நீங்கள் எந்த திறமையைத் தேர்ந்தெடுப்பீர்கள்?\"`")



    if x==6:



        await event.edit("`\"எந்த மூன்று வார்த்தைகள் உங்களை விவரிக்க முடியும்?\"`")



    if x==7:



        await event.edit("`\"உங்கள் தொலைபேசியிலிருந்து ஒரு பயன்பாட்டை நீக்க வேண்டியிருந்தால், அது என்னவாக இருக்கும்?\"`")



    if x==8:



        await event.edit("`\"நான் பூமியில் கடைசி நபராக இருந்தால் என்னுடன் வெளியே செல்வீர்களா?\"`")



    if x==9:



        await event.edit("`\"நீங்கள் பாலினத்தை மாற்றினால், நீங்கள் என்ன செய்வீர்கள்?\"`")



    if x==10:



        await event.edit("`\"நீங்கள் இங்கே ஒருவருடன் மதிய உணவு சாப்பிட முடிந்தால். நீங்கள் யாரைத் தேர்ந்தெடுப்பீர்கள்?\"`")



    if x==11:



        await event.edit("`\"வாழ ஒரு வாரம் மட்டுமே உள்ளது என்று உங்களிடம் கூறப்பட்டால், நீங்கள் என்ன செய்வீர்கள்?\"`")



    if x==12:



        await event.edit("`\"உங்கள் வீட்டிலிருந்து நீங்கள் சேமிக்கும் நம்பர் ஒன் பொருள் எது?\"`")



    if x==13:



        await event.edit("`\"உங்கள் வாழ்நாள் முழுவதும் ஒரு நபருக்கு மட்டுமே Msg அனுப்ப முடிந்தால், ஆனால் அந்த நபருடன் நீங்கள் ஒருபோதும் நேருக்கு நேர் பேச முடியாது, அது யார்?\"`")



    if x==14:



        await event.edit("`\"எதிர்காலத்தில் எத்தனை குழந்தைகளைப் பெற விரும்புகிறீர்கள்?\"`")



    if x==15:



        await event.edit("`\"இந்த குழுவில் யார் இன்றுவரை மோசமான நபராக இருப்பார்கள்? ஏன்?\"`")



    if x==16:



        await event.edit("`\"உங்கள் Dream Girl or Boy எப்படி இருக்கிறார்கள்?\"`")



    if x==17:



        await event.edit("`\"உங்கள் Browsing History யாராவது பார்த்தால் நீங்கள் சங்கடப்படுவீர்களா?\"`")



    if x==18:



        await event.edit("`\"நீங்கள் Bathroom-ல் பாடுவீர்களா??\"`")



    if x==19:



        await event.edit("`\"திருமணம் செய்ய சரியான வயது எது?\"`")



    if x==20:



        await event.edit("`\"வாழ்க்கைக்கான உங்கள் முதல் 5 விதிகள் யாவை?\"`")



    if x==21:



        await event.edit("`\"ஒரு விருப்பம் வழங்கப்பட்டால், நீங்கள் கடற்கரையில் அல்லது மலைகளில் விடுமுறை தேர்வு செய்வீர்களா?\"`")



    if x==22:



        await event.edit("`\"உங்கள் நாட்டின் president-ஆக நீங்கள் நியமிக்கப்பட்டால், நீங்கள் முதலில் என்ன செய்வீர்கள்?\"`")



    if x==23:



        await event.edit("`\"பூமியில் மிகவும் பிரபலமான 3 பேரைச் சந்திக்க வாய்ப்பு வழங்கப்பட்டால், அது யார், விருப்பத்திற்கு ஏற்ப பதிலளிக்கவும்.\"`")



    if x==24:



        await event.edit("`\"நீங்கள் எப்போதாவது ஒரு superpower வேண்டும் என்று விரும்பினீர்களா, அப்படியானால், நீங்கள் எந்த superpower-யை விரும்புகிறீர்கள்?\"`")



    if x==25:



        await event.edit("`\"தொலைபேசி மற்றும் இணையம் இல்லாமல் ஒரு நாள் முழுவதும் செலவிட முடியுமா? ஆம் என்றால், நீங்கள் என்ன செய்வீர்கள்?\"`")



    if x==26:



        await event.edit("`\"Live-in relation அல்லது marriage, நீங்கள் எதை விரும்புகிறீர்கள்?\"`")



    if x==27:



        await event.edit("`\"உங்களுக்கு பிடித்த உணவு அல்லது உணவு வகை எது?\"`")



    if x==28:



        await event.edit("`\"உங்கள் நாட்டில் கல்வி முறை பற்றி சில நல்ல மற்றும் கெட்ட விஷயங்கள் என்ன?\"`")



    if x==29:



        await event.edit("`\"ஆன்லைன் கல்வி பற்றி நீங்கள் என்ன நினைக்கிறீர்கள்?\"`")



    if x==30:



        await event.edit("`\"நீங்கள் அடையத் தவறிய சில குறிக்கோள்கள் என்ன?\"`")



    if x==31:



        await event.edit("`\"Technology மனித இனத்தை காப்பாற்றுமா அல்லது அழிக்குமா?\"`")



    if x==32:



        await event.edit("`\"கடந்த 50 ஆண்டுகளில் சிறந்த கண்டுபிடிப்பு எது?\"`")



    if x==33:



        await event.edit("`\"நீங்கள் வேறு எந்த நாடுகளுக்கும் பயணம் செய்திருக்கிறீர்களா? எது?\"`")



    if x==34:



        await event.edit("`\"எந்த விளையாட்டு பார்க்க மிகவும் உற்சாகமானது? பார்ப்பதற்கு மிகவும் சலிப்பு எது?\"`")



    if x==35:



        await event.edit("`\"நீங்கள் விளையாடிய மிகவும் addictive mobile விளையாட்டு எது?\"`")



    if x==36:



        await event.edit("`\"உங்கள் தொலைபேசியில் எத்தனை Apps உள்ளன?\"`")



    if x==37:



        await event.edit("`\"நீங்கள் கேட்ட கடைசி பாடல் எது??\"`")



    if x==38:



        await event.edit("`\"தியேட்டரில் அல்லது உங்கள் சொந்த வீட்டின் வசதியில் திரைப்படங்களைப் பார்க்க விரும்புகிறீர்களா??\"`")



    if x==39:



        await event.edit("`\"உங்களுக்கு திகில் திரைப்படங்கள் பிடிக்குமா? ஏன் அல்லது ஏன் இல்லை?\"`")



    if x==40:



        await event.edit("`\"மற்றவர்களுக்கு எத்தனை முறை உதவுகிறீர்கள்? நீங்கள் யாருக்கு உதவுகிறீர்கள்? நீங்கள் எவ்வாறு உதவுகிறீர்கள்?\"`")



    if x==41:



        await event.edit("`\"நீங்கள் எந்த பாடலை அடிக்கடி இசைக்கிறீர்கள்?\"`")



    if x==42:



        await event.edit("`\"இந்த குழுவில் சேர்க்கப்பட வேண்டிய புதிய விதியை பரிந்துரைக்கவும்!\"`")



    if x==43:



        await event.edit("`\"உங்கள் தொலைபேசியில் என்ன App எனக்கு கிடைக்க வேண்டும் என்று நினைக்கிறீர்கள்?\"`")



    if x==44:



        await event.edit("`\"எந்த Website அல்லது App உங்கள் வாழ்க்கையை சிறப்பாகவோ அல்லது மோசமாகவோ மாற்றிவிட்டது?\"`")



    if x==45:



        await event.edit("`\"எது உண்மையானது அல்ல, ஆனால் நீங்கள் அதை விரும்புகிறீர்களா?\"`")



    if x==46:



        await event.edit("`\"நீங்கள் இப்போது என்ன வாங்க விரும்புகிறீர்கள்?\"`")



    if x==47:



        await event.edit("`\"இந்த குழுவிலிருந்து ஒரு நிர்வாகியை நீங்கள் தடை செய்ய முடிந்தால். நீங்கள் யாரை விரும்புகிறீர்கள்?\"`")



    if x==48:



        await event.edit("`\"உங்கள் பையில் 2 கோடி பணத்தை யாராவது நிரப்பி விட்டால் நீங்கள் என்ன செய்வீர்கள்\"`")



    if x==49:



        await event.edit("`\"உங்களுக்குத் தெரிந்த அதிர்ஷ்டசாலி யார்?\"`")



    if x==50:



        await event.edit("`\"இந்த குழுவில் உள்ள ஒருவரின் வீட்டிற்கு நீங்கள் செல்ல முடிந்தால், அது யார்?\"`")



    if x==51:



        await event.edit("`\"நீங்கள் எதைப் பற்றி கேட்டு சோர்வடைகிறீர்கள்?\"`")



    if x==52:



        await event.edit("`\"இன்று நீங்கள் இறந்துவிட்டால், உங்கள் மிகப்பெரிய சாதனை என்னவாக இருக்கும்😂?\"`")



    if x==53:



        await event.edit("`\"உங்களைக் கொல்ல நீங்கள் எந்த முறையைத் தேர்ந்தெடுப்பீர்கள்?\"`")



    if x==54:



        await event.edit("`\"கடந்த 24 மணி நேரத்தில் நீங்கள் கேள்விப்பட்ட சிறந்த செய்தி எது?\"`")



    if x==55:



        await event.edit("`\"உங்கள் நாட்டின் கல்வி முறைக்கு செய்யப்பட வேண்டிய மிக முக்கியமான மாற்றம் என்ன?\"`")



    if x==56:



        await event.edit("`\"உங்களுக்கு பிடித்த stickerpack-யை அனுப்புங்கள் .\"`")



    if x==57:



        await event.edit("`\"உங்களுக்கு பிடித்த animated sticker pack-யை அனுப்பவும்.\"`")



    if x==58:



        await event.edit("`\"உங்களுக்கு பிடித்த video அல்லது gif ஐ அனுப்பவும்.\"`")



    if x==59:



        await event.edit("`\"உங்களுக்கு பிடித்த emojies அனுப்பவும்\"`")



    if x==60:



        await event.edit("`\"குழந்தையாக நீங்கள் தவறாகப் புரிந்துகொண்டு, பின்னர் மட்டுமே தவறு என்று உணர்ந்தது எது?\"`")
